ЛИС2/src/InformationRegisters/лис_ЖурналОпределенияКомпонентовВАтмосферномВоздухе/лис_ЖурналОпределенияКомпонентовВАтмосферномВоздухе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>лис_ЖурналОпределенияКомпонентовВАтмосферномВоздухе</name>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОтбора</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Компонент</name>
    <type>
      <types>CatalogRef.лис_КомпонентыЗамеровЛаборатории</types>
    </type>
  </resources>
  <resources>
    <name>ОбъемПробы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ОКЕИ</types>
    </type>
  </resources>
  <resources>
    <name>Методика</name>
    <type>
      <types>CatalogRef.МетодикиОпределенияИзмеренияАнализа</types>
    </type>
  </resources>
  <resources>
    <name>ПоказаниеПрибора1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоказаниеПрибора2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоказаниеПрибора3</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоказаниеПрибора4</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоказаниеПрибора5</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СреднееЗначение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СодержаниеПоРасчету</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерПробы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.лис_ЖурналОпределенияКомпонентовВАтмосферномВоздухе</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АктОтбора</name>
    <type>
      <types>DocumentRef.лис_АктОтбораПроб</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТочкаОтбораПробы</name>
    <type>
      <types>CatalogRef.ТочкиКонтроля</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОпределяемыйПоказатель</name>
    <type>
      <types>CatalogRef.КонтролируемыеПараметрыВПочвеДонныхОтложениях</types>
      <types>CatalogRef.ЗВВода</types>
      <types>CatalogRef.КонтролируемыеПоказателиВВоде</types>
      <types>CatalogRef.ФакторыФизическогоВоздействия</types>
      <types>CatalogRef.ЗВАтмосфера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШифрПробы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЛИС2/src/InformationRegisters/лис_ЖурналОпределенияКомпонентовВАтмосферномВоздухе/Forms/ФормаЗаписейПоАкту/Module.bsl
#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ВыпуститьПротоколНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПротоколКонтроляКачестваАтмосферногоВоздуха.Ссылка
	               |ИЗ
	               |	Документ.ПротоколКонтроляКачестваАтмосферногоВоздуха КАК ПротоколКонтроляКачестваАтмосферногоВоздуха
	               |ГДЕ
	               |	ПротоколКонтроляКачестваАтмосферногоВоздуха.лис_АктОтбора = &Акт
	               |	И ПротоколКонтроляКачестваАтмосферногоВоздуха.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("Акт", АктОтбора);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		
		Протокол = Документы.ПротоколКонтроляКачестваАтмосферногоВоздуха.СоздатьДокумент();
		Протокол.Дата = ТекущаяДата();
		Протокол.Организация = Документ.Организация;
		Протокол.ДатаПротокола = ТекущаяДата();
		Протокол.лис_АктОтбора = АктОтбора;
		Протокол.Ответственный = Документ.Ответственный;
			
		НаборЗаписей = РегистрыСведений.лис_ЖурналОпределенияКомпонентовВАтмосферномВоздухе.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.АктОтбора.Установить(АктОтбора);
		НаборЗаписей.Отбор.Документ.Установить(Документ);
		НаборЗаписей.Прочитать();
		
		Для Каждого Строка Из НаборЗаписей Цикл
			НоваяСтрокаЗамеры = Протокол.Замеры.Добавить();
			НоваяСтрокаЗамеры.ОбъектКонтроля = АктОтбора.ОбъектКонтроля;
			НоваяСтрокаЗамеры.ОбъектОтбораПроб = АктОтбора.ОбъектОтбораПроб;
			НоваяСтрокаЗамеры.ТочкаКонтроля = Строка.ТочкаОтбораПробы;
			НоваяСтрокаЗамеры.Температура = АктОтбора.ТемператураВоздухаВМестеОтбора;
			НоваяСтрокаЗамеры.Ключ = Строка(Новый УникальныйИдентификатор);
		
			НоваяСтрока = Протокол.РезультатыЗамеров.Добавить();
			НоваяСтрока.ЗагрязняющееВещество = Строка.ОпределяемыйПоказатель;
			НоваяСтрока.Концентрация = Строка.СодержаниеПоРасчету;
	 		НоваяСтрока.Ключ = НоваяСтрокаЗамеры.Ключ;
		КонецЦикла;
		
		Протокол.Записать();
		
		Возврат Протокол.Ссылка;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Документ = Параметры.Документ;
	АктОтбора = Параметры.АктОтбора;

	Основное.Отбор.Элементы.Очистить(); 
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Основное, "Документ", Документ, ВидСравненияКомпоновкиДанных.Равно,,Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Основное, "АктОтбора", АктОтбора, ВидСравненияКомпоновкиДанных.Равно,,Истина);

КонецПроцедуры


&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыпуститьПротокол(Команда)
	
	Протокол = ВыпуститьПротоколНаСервере();
	ОповеститьОбИзменении(Протокол);

	ПараметрыФормы = Новый Структура("Ключ", Протокол);
	
	ОткрытьФорму("Документ.ПротоколКонтроляКачестваАтмосферногоВоздуха.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);

КонецПроцедуры

#КонецОбласти
